In [29]:
import pandas as pd
import numpy as np

## Series

In [30]:
label = ['a', 'b', 'c']
my_data = [10, 20, 30]
dt = pd.Series(data=my_data, index=label, dtype=np.int32)
print(dt)
# Print the data as a table
dt.to_frame()

a    10
b    20
c    30
dtype: int32

    0
a  10
b  20
c  30

## DataFrame

In [31]:
row = ['John', 'Bob', 'Alice', 'Mary', 'Mike']
col = ['age', 'state', 'score', 'grade']
data = [[23, 'CA', 90, 'A'], [20, 'NY', 80, 'B'], [
    25, 'TX', 70, 'C'], [27, 'FL', 60, 'D'], [30, 'WA', 50, 'F']]
df = pd.DataFrame(data=data, index=row, columns=col)
print(df, '\n')
df['gender'] = ['M', 'M', 'F', 'F', 'M']
print(df.loc[['John']], '\n')
print(df.info(), '\n')
print(df.describe())

       age state  score grade
John    23    CA     90     A
Bob     20    NY     80     B
Alice   25    TX     70     C
Mary    27    FL     60     D
Mike    30    WA     50     F

      age state  score grade gender
John   23    CA     90     A      M

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, John to Mike
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   age     5 non-null      int64
 1   state   5 non-null      object
 2   score   5 non-null      int64
 3   grade   5 non-null      object
 4   gender  5 non-null      object
dtypes: int64(2), object(3)
memory usage: 412.0+ bytes
None

             age      score
count   5.000000   5.000000
mean   25.000000  70.000000
std     3.807887  15.811388
min    20.000000  50.000000
25%    23.000000  60.000000
50%    25.000000  70.000000
75%    27.000000  80.000000
max    30.000000  90.000000

# Handling Missing Data

In [32]:
# Mock dataframe for Nan value
df2 = pd.DataFrame({'A': [1, 2, np.nan], 'B': [5, np.nan, np.nan],
                    'C': [1, 2, 3]})
print(df2, '\n')

# Drop the row with Nan value
print(df2.dropna(axis=1, thresh=2), '\n')

# Fill the Nan value with 0
print(df2.fillna(value=0), '\n')

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

     A  C
0  1.0  1
1  2.0  2
2  NaN  3

     A    B  C
0  1.0  5.0  1
1  2.0  0.0  2
2  0.0  0.0  3

# Merging data

In [33]:
# Vietnam have many famous food,such as Pho, Bun Cha, Banh Mi, Banh Xeo, etc.
# Create a dataframe to store the information of these food, cost, and the place where you can find them.
df_food = pd.DataFrame({'Food': ['Pho', 'Bun Cha', 'Banh Mi', 'Banh Xeo'],
                        'Cost': [2, 3, 1, 2],
                        'Place': ['Ha Noi', 'Ha Noi', 'Ho Chi Minh', 'Da Nang']})
# make a unit for cost
df_food['Cost'] = df_food['Cost'].apply(lambda x: str(x))
# Food is the index
# df_food.set_index('Food', inplace=True)
print(df_food, '\n')

# Create another dataframe about place and its scenic spots, one place can have many scenic spots.
df_place = pd.DataFrame({'Place': ['Ha Noi', 'Ho Chi Minh', 'Da Nang'],
                         'Scenic Spots': ['West Lake',
                                          'Ben Thanh Market',
                                          'My Khe Beach']})

# df_place.set_index('Place', inplace=True)
print(df_place, '\n')

# Merge two dataframe
df_merge = pd.merge(df_food, df_place, on='Place')

print(df_merge, '\n')

# df_merge.groupby(['Place','Food']).count().loc["Ha Noi"].loc["Bun Cha"]

# Convert column type from object to string
df_merge['Cost'] = df_merge['Cost'].astype(float)
print(df_merge.info(), '\n')

       Food Cost        Place
0       Pho    2       Ha Noi
1   Bun Cha    3       Ha Noi
2   Banh Mi    1  Ho Chi Minh
3  Banh Xeo    2      Da Nang

         Place      Scenic Spots
0       Ha Noi         West Lake
1  Ho Chi Minh  Ben Thanh Market
2      Da Nang      My Khe Beach

       Food Cost        Place      Scenic Spots
0       Pho    2       Ha Noi         West Lake
1   Bun Cha    3       Ha Noi         West Lake
2   Banh Mi    1  Ho Chi Minh  Ben Thanh Market
3  Banh Xeo    2      Da Nang      My Khe Beach

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Food          4 non-null      object
 1   Cost          4 non-null      float64
 2   Place         4 non-null      object
 3   Scenic Spots  4 non-null      object
dtypes: float64(1), object(3)
memory usage: 160.0+ bytes
None

# Pivot Table

In [34]:
data = {'Company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
        'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
        'Sales': [200, 120, 340, 124, 243, 350]}
df = pd.DataFrame(data)
print(df, '\n')
# Pivot table
print(df.pivot_table(values='Sales', index=['Company', 'Person']), '\n')

# More complex pivot table
df = pd.DataFrame({'A': ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'],
                   'B': ['one', 'one', 'two', 'two', 'one', 'one'],
                   'C': ['x', 'y', 'x', 'y', 'x', 'y'],
                   'D': [1, 3, 2, 5, 4, 1]})
print(df, '\n')
print(df.pivot_table(values='D', index=['A', 'B'], columns=['C']), '\n')

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

                 Sales
Company Person
FB      Carl       243
        Sarah      350
GOOG    Charlie    120
        Sam        200
MSFT    Amy        340
        Vanessa    124

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [36]:
df_penguin = pd.read_csv('../datasets/penguins_raw.csv')
df_penguin.drop('Unnamed: 0', axis=1, inplace=True)
print(df_penguin.head(10), '\n')
# count number of male and female penguins
df_penguin['Sex'].value_counts().to_dict()
df_penguin["Species"].co

  studyName  Sample Number                              Species  Region  \
0   PAL0708              1  Adelie Penguin (Pygoscelis adeliae)  Anvers
1   PAL0708              2  Adelie Penguin (Pygoscelis adeliae)  Anvers
2   PAL0708              3  Adelie Penguin (Pygoscelis adeliae)  Anvers
3   PAL0708              4  Adelie Penguin (Pygoscelis adeliae)  Anvers
4   PAL0708              5  Adelie Penguin (Pygoscelis adeliae)  Anvers
5   PAL0708              6  Adelie Penguin (Pygoscelis adeliae)  Anvers
6   PAL0708              7  Adelie Penguin (Pygoscelis adeliae)  Anvers
7   PAL0708              8  Adelie Penguin (Pygoscelis adeliae)  Anvers
8   PAL0708              9  Adelie Penguin (Pygoscelis adeliae)  Anvers
9   PAL0708             10  Adelie Penguin (Pygoscelis adeliae)  Anvers

      Island               Stage Individual ID Clutch Completion    Date Egg  \
0  Torgersen  Adult, 1 Egg Stage          N1A1               Yes  2007-11-11
1  Torgersen  Adult, 1 Egg Stage          N1A2               Yes  2007-11-11
2  Torgersen  Adult, 1 Egg Stage          N2A1               Yes  2007-11-16
3  Torgersen  Adult, 1 Egg Stage          N2A2               Yes  2007-11-16
4  Torgersen  Adult, 1 Egg Stage          N3A1               Yes  2007-11-16
5  Torgersen  Adult, 1 Egg Stage          N3A2               Yes  2007-11-16
6  Torgersen  Adult, 1 Egg Stage          N4A1                No  2007-11-15
7  Torgersen  Adult, 1 Egg Stage          N4A2                No  2007-11-15
8  Torgersen  Adult, 1 Egg Stage          N5A1               Yes  2007-11-09
9  Torgersen  Adult, 1 Egg Stage          N5A2               Yes  2007-11-09

   Culmen Length (mm)  Culmen Depth (mm)  Flipper Length (mm)  Body Mass (g)  \
0                39.1               18.7                181.0         3750.0
1                39.5               17.4                186.0         3800.0
2                40.3               18.0                195.0         3250.0
3                 NaN                NaN                  NaN            NaN
4                36.7               19.3                193.0         3450.0
5                39.3               20.6                190.0         3650.0
6                38.9               17.8                181.0         3625.0
7                39.2               19.6                195.0         4675.0
8                34.1               18.1                193.0         3475.0
9                42.0               20.2                190.0         4250.0

      Sex  Delta 15 N (o/oo)  Delta 13 C (o/oo)  \
0    MALE                NaN                NaN
1  FEMALE            8.94956          -24.69454
2  FEMALE            8.36821          -25.33302
3     NaN                NaN                NaN
4  FEMALE            8.76651          -25.32426
5    MALE            8.66496          -25.29805
6  FEMALE            9.18718          -25.21799
7    MALE            9.46060          -24.89958
8     NaN                NaN                NaN
9     NaN            9.13362          -25.09368

                                Comments
0         Not enough blood for isotopes.
1                                    NaN
2                                    NaN
3                     Adult not sampled.
4                                    NaN
5                                    NaN
6  Nest never observed with full clutch.
7  Nest never observed with full clutch.
8              No blood sample obtained.
9   No blood sample obtained for sexing.

{'MALE': 168, 'FEMALE': 165}

In [2]:
df_penguin.apply()

4